[
  {
    "User ID": 716284640708587500,
    "Display Name": "Shpooople",
    "Team Name": "The ImBortles",
    "Wins": 3,
    "Losses": 5,
    "Ties": 0,
    "Points For": 446,
    "Points Against": 539,
    "Adjusted Average": 123.1,
    "TREND": "UP",
    "Trend Percentage": 8.4,
    "QB Strength": 60,
    "RB Strength": 72,
    "WR Strength": 89,
    "TE Strength": 76,
    "K Strength": 67,
    "QB": "Justin Fields",
    "RB": "Blake Corum, Brashard Smith, Omarion Hampton, TreVeyon Henderson, Derrick Henry",
    "WR": "Keenan Allen, Calvin Ridley, DJ Moore, Drake London, George Pickens",
    "TE": "Mark Andrews, Brenton Strange",
    "K": "Cam Little",
    "DEF": "Jacksonville Jaguars",
    "POWER RANK": 9,
    "Power Rank Score": 8.4,
    "COMMENTS": "Der Rookie Gamble in den Draftrunden 3 und 4 schien nach Woche 2 ein perversester Griff ins Klo gewesen zu sein. Aber wenigstens Omarion Hampton hat zwei gute Performances am Stück gezeigt.\nAllgemein sieht meine Draftclass eher bescheiden aus. Henderson, DJ Moore, Calvin fucking Ridley und selbst Derrick Henry und Drake London haben alle noch nicht ihre Draftposition gerechtfertigt. Die schlechteste Woche des Jahres haben die Imbortles auch noch hingelegt. \n67 Punkte! Zum Glück werden die schlechtesten und besten Performances im AAvg gestrichen.\nAber gut, das war auch gegen Lücke. Gegen die Voodoo Magic sind wir alle machtlos.",
    "Week 1": 118.38,
    "Week 2": 67.93,
    "Week 3": 127.73,
    "Week 4": 132.26
  },
  {
    "User ID": 718519453150679000,
    "Display Name": "Sternburg1000",
    "Team Name": "Always sunny´n Scarycity",
    "Wins": 4,
    "Losses": 4,
    "Ties": 0,
    "Points For": 475,
    "Points Against": 398,
    "Adjusted Average": 117.5,
    "TREND": "NO TREND",
    "Trend Percentage": -4.2,
    "QB Strength": 76,
    "RB Strength": 66,
    "WR Strength": 87,
    "TE Strength": 36,
    "K Strength": 85,
    "QB": "Bo Nix, Jordan Love",
    "RB": "Nick Chubb, Tony Pollard, Kyren Williams",
    "WR": "Troy Franklin, Terry McLaurin, Darius Slayton, Jerry Jeudy, Amon-Ra St. Brown, Zay Flowers",
    "TE": "Darren Waller, George Kittle",
    "K": "Jason Myers",
    "DEF": "Buffalo Bills, Los Angeles Rams",
    "POWER RANK": 11,
    "Power Rank Score": 9.88,
    "COMMENTS": "208 Punkte. Quasi ein Rekordspieltag oder zwei schlechte Spieltage zusammen. Soviele Punkte hat Lücke weniger kassiert als Tine. 398 vs 606. \nIch würde ja gerne über was anderes schreiben. Wie sein Draft lief, oder welche Moves er gemacht hat. Aber die immer wiederkehrende Devil Magic darf nicht unter den Tisch gekehrt werden. \nAber wenn man sich Lückes Team anschaut, dann sieht das doch garnicht mal so furchtbar aus. Kyren und Pollard als RB1 und RB2 ist nicht besonders sexy aber der WR Room sieht etwas besser aus. Wenn Kittle von IR zurück kommt und Scary Terry wieder zur 2024 Form aufläuft, dann wird das Team noch richtig gefährlich.\nSollte Terry jedoch nicht performt, dann kann er gerne zu mir nach hause kommen. Love you Terry.",
    "Week 1": 112.09,
    "Week 2": 133.79,
    "Week 3": 106.92,
    "Week 4": 122.89
  },
  {
    "User ID": 718524962947801100,
    "Display Name": "Schleckeracci",
    "Team Name": "The Founding Fathers",
    "Wins": 2,
    "Losses": 6,
    "Ties": 0,
    "Points For": 476,
    "Points Against": 517,
    "Adjusted Average": 122.3,
    "TREND": "UP",
    "Trend Percentage": 8.3,
    "QB Strength": 96,
    "RB Strength": 58,
    "WR Strength": 88,
    "TE Strength": 91,
    "K Strength": 71,
    "QB": "Matthew Stafford, Lamar Jackson",
    "RB": "Woody Marks, RJ Harvey, Joe Mixon, Jaylen Warren",
    "WR": "Tre Tucker, Brian Thomas, Keon Coleman, Justin Jefferson, Rashod Bateman, Romeo Doubs, Tyquan Thornton",
    "TE": "Trey McBride",
    "K": "Chase McLaughlin",
    "DEF": "Indianapolis Colts, Washington Commanders",
    "POWER RANK": 10,
    "Power Rank Score": 8.85,
    "COMMENTS": "Unser erstes Co-Owner Team hat beim Draft direkt gezeigt wie man es nicht macht. Absolute Vollkatastrophe, gekröhnt von einem Shadeur Sanders pick. Einfach einen Pick völlig sorglos entsorgt.\nMacht das Sinn? Ganz klar nein. Aber vielleicht bringts ja Glück. Sieht aber bisher irgendwie nicht so aus. \nDie beiden first Rounder liefern nur bedingt ab. Selbst der sonst so konstante JJ ist nicht voll bei der Sache. JJ McCarthy und Wentz sind halt keine Kirk Cousins oder Sam Darnolds. Wow die Vikings haben echt die weißesten der weißen Dudes als QBs.\nDoch man sieht Licht am Ende des Tunnels: Jo'Quavious Dequane „Woody“ Marks ist keine Sketch Figur aus Key and Peele, sondern the second coming of Ladanian Tomlinson. Das hoffen die Gründerväter nach eine mega Performance gegen ..... die Titans..... ahhh shit.\nAber der Woody von den beiden sieht wirklich stabil aus. Vermutlich der schlechtese RB Room, wird sonst von Lamar ausgeglichen, aber der ist jetzt auch angeschlagen.\nWenn in Woche 5 keine bessere Leistung der hohen Picks kommt, müssen vielleicht mal ein paar ungemütliche Trades gemacht werden.",
    "Week 1": 101.16,
    "Week 2": 115.95,
    "Week 3": 128.67,
    "Week 4": 131.08
  },
  {
    "User ID": 718516055202418700,
    "Display Name": "kobekope",
    "Team Name": "Alvin had a little Lamb",
    "Wins": 6,
    "Losses": 2,
    "Ties": 0,
    "Points For": 536,
    "Points Against": 482,
    "Adjusted Average": 136.1,
    "TREND": "UP",
    "Trend Percentage": 10.1,
    "QB Strength": 86,
    "RB Strength": 84,
    "WR Strength": 63,
    "TE Strength": 100,
    "K Strength": 71,
    "QB": "Drake Maye, Dak Prescott",
    "RB": "Ollie Gordon, Alvin Kamara, Aaron Jones, Tyler Allgeier, Rachaad White, James Cook",
    "WR": "Courtland Sutton, Deebo Samuel, CeeDee Lamb, Rashid Shaheed, Josh Downs",
    "TE": "Juwan Johnson, Jake Ferguson",
    "K": "Tyler Loop",
    "DEF": "New Orleans Saints",
    "POWER RANK": 2,
    "Power Rank Score": 3.42,
    "COMMENTS": "Köppi hatte einen sehr guten Draft. Fast jeder Pick sieht gut aus. Selbst mit der CD Verletzung hat das Veteran Team weiterhin jede Menge Punkte gemacht. Köppi hat auf das Konzept \"keine Experimente\" gesetzt.\nRookies kommen bei Köppi nur ins Haus, wenn sie bei den Ravens Field Goals kicken. Ich sehe hier einen klaren Titelfavoriten, ohne große Schwäche. Er hat die 20 extra FAAB in Woche 1 auch anscheinend nicht gebraucht.\nZur Belohnung darf er diese Woche gegen den Juggernaut \"The Founding Fathers\", ohne Lamar Jackson ran. Who dat? Naja, wenigstens sind die Saints scheiße.....aber sie sind so scheiße, dass sie um den First Pick mitspielen.\nLäuft bei Köppi.",
    "Week 1": 132.37,
    "Week 2": 139.89,
    "Week 3": 116.24,
    "Week 4": 147.82
  },
  {
    "User ID": 718795712124510200,
    "Display Name": "pk123",
    "Team Name": "No Team Name",
    "Wins": 4,
    "Losses": 4,
    "Ties": 0,
    "Points For": 533,
    "Points Against": 494,
    "Adjusted Average": 128.7,
    "TREND": "UP",
    "Trend Percentage": 15,
    "QB Strength": 64,
    "RB Strength": 88,
    "WR Strength": 100,
    "TE Strength": 73,
    "K Strength": 69,
    "QB": "Kyler Murray",
    "RB": "Jacory Croskey-Merritt, Josh Jacobs, D'Andre Swift, Kenneth Gainwell, Chase Brown",
    "WR": "Malik Washington, Marvin Harrison, Tyreek Hill, Chris Godwin, Brandon Aiyuk, Puka Nacua, Quentin Johnston",
    "TE": "Sam LaPorta, Zach Ertz",
    "K": "Ka'imi Fairbairn",
    "DEF": "Arizona Cardinals",
    "POWER RANK": 3,
    "Power Rank Score": 4.3,
    "COMMENTS": "Tja, Philipp hat immer ein gutes Team. Jedes verdammtes Jahr. Man kann es nicht anders sagen. Es besteht dieses Jahr für meinen Geschmack aus zu vielen Cardinals, aber selbst das scheint ja kein Problem zu sein.\nPuka Nacua sieht aus wie der WR1 dieses Jahr und ist auf einem neuen Rekordkurs. Den hätte man mal draften sollen. Sein Team hat zwar viele RBs aber um es mit seinen eigenen Worten zu sagen: Keiner ist so richtig geil.\nIch paraphrasiere hier. Wenn die Season wie geohnt läuft, dann endet sie für PK123 wieder tief in den Playoffs. Aktuell würde ich da nicht gegen wetten.",
    "Week 1": 136.67,
    "Week 2": 120.75,
    "Week 3": 105.26,
    "Week 4": 170.6
  },
  {
    "User ID": 722748718910083100,
    "Display Name": "TinyDancerTiez",
    "Team Name": "Chubaker",
    "Wins": 3,
    "Losses": 5,
    "Ties": 0,
    "Points For": 506,
    "Points Against": 606,
    "Adjusted Average": 127,
    "TREND": "NO TREND",
    "Trend Percentage": 6,
    "QB Strength": 76,
    "RB Strength": 64,
    "WR Strength": 99,
    "TE Strength": 100,
    "K Strength": 73,
    "QB": "Baker Mayfield",
    "RB": "Emari Demercado, Isaiah Davis, Chuba Hubbard, Breece Hall, Isiah Pacheco",
    "WR": "Emeka Egbuka, Stefon Diggs, Michael Pittman, Nico Collins, Garrett Wilson",
    "TE": "Hunter Henry, Evan Engram",
    "K": "Matt Prater",
    "DEF": "Seattle Seahawks",
    "POWER RANK": 6,
    "Power Rank Score": 6.85,
    "COMMENTS": "Vielleicht ist es noch zu früh, aber der -Football in die Leisten- geht dieses Jahr vermutlich an Tiny Danger. Jede Woche ne ordentliche Packung. Die Fantasy Götter meinen es dieses Jahr besonders gut mit Tine.\nWobei man sagen muss, dass das vermutlich ausgeglichene Gerechtigkeit für den Malik Nabers trade ist. Aber das haben wir ja bei Mo schon genug besprochen. \nDiese Woche gehts gegen den Voodoo Meister aus Friedrichshain und der eigene QB spielt gegen die eigene Defense. Was soll schon schiefgehen?",
    "Week 1": 114.08,
    "Week 2": 138.45,
    "Week 3": 115.57,
    "Week 4": 138.81
  },
  {
    "User ID": 723145047784116200,
    "Display Name": "oppossumfrank",
    "Team Name": "Pandan Buns",
    "Wins": 6,
    "Losses": 2,
    "Ties": 0,
    "Points For": 567,
    "Points Against": 488,
    "Adjusted Average": 148.3,
    "TREND": "UP",
    "Trend Percentage": 33.8,
    "QB Strength": 84,
    "RB Strength": 100,
    "WR Strength": 75,
    "TE Strength": 93,
    "K Strength": 62,
    "QB": "Jalen Hurts",
    "RB": "Ashton Jeanty, Jonathan Taylor, Michael Carter, Jordan Mason, Tyjae Spears, Kendre Miller",
    "WR": "Rome Odunze, Xavier Worthy, Mike Evans, Jauan Jennings, Wan'Dale Robinson, Jameson Williams",
    "TE": "Dalton Kincaid, Tucker Kraft",
    "K": "Joshua Karty",
    "DEF": "Minnesota Vikings",
    "POWER RANK": 1,
    "Power Rank Score": 1.92,
    "COMMENTS": "Leo meints wohl ernst mit seinem Last Dance, wobei er ja gesagt hat, dass er weiter spielen wird, sollte er gewinnen. Sein Team ist jedenfalls STACKED. Rome Odunze hat aktuell den Titel League Winner, JT macht \"2021 JT\" Sachen, und Ashton Jeanty kommt auch endlich in Schwung. \nEs regnet Highscore nach Highscore, Woche für Woche. Und das auch noch ohne Mike Evans. Wir sehen uns dann wohl doch noch nächstes Jahr. Ich würde es Leo ja gönnen, auch wenn er danach retired.",
    "Week 1": 93.13,
    "Week 2": 153.44,
    "Week 3": 177.79,
    "Week 4": 143.25
  },
  {
    "User ID": 1127992026114461700,
    "Display Name": "benjyalf",
    "Team Name": "BUTlicKER",
    "Wins": 4,
    "Losses": 4,
    "Ties": 0,
    "Points For": 490,
    "Points Against": 518,
    "Adjusted Average": 125.6,
    "TREND": "UP",
    "Trend Percentage": 22.8,
    "QB Strength": 100,
    "RB Strength": 69,
    "WR Strength": 62,
    "TE Strength": 69,
    "K Strength": 67,
    "QB": "Caleb Williams, Josh Allen",
    "RB": "Quinshon Judkins, Christian McCaffrey",
    "WR": "Cedric Tillman, Tory Horton, Matthew Golden, Christian Kirk, DK Metcalf, A.J. Brown, Jordan Addison",
    "TE": "Travis Kelce",
    "K": "Harrison Butker",
    "DEF": "Baltimore Ravens, Pittsburgh Steelers",
    "POWER RANK": 5,
    "Power Rank Score": 5.15,
    "COMMENTS": "In den ersten zwei Wochen sah es so aus, als würde Bens Team dieses Jahr richtig abstinken. Aber zwei Wochen mit +140 Points am Stück gegen mich und Tine, und schon gehts steil nach oben für den Fantasy Padawan.\nQuinshon Judkins sieht aus wie Superstar in the Making, wenn er nicht gesperrt wird, dann war das ein richtiger Draftsteal. Bens Draft war geprägt von Big Names: Josh Allen, CMC, Kelce, AJ Brown, Metcalf und..... Butker in der zehnten Runde?\nWenn Kaleb Johnson nicht so ein kolossaler Reinfall gewesen wäre und AJ Brown nicht schon nach Woche 4 kryptische WR Diva Tweets raushauen würde, dann wäre Bens top heavy Team noch stärker. Der Junge draftet irgendwie immer gut.",
    "Week 1": 108.76,
    "Week 2": 86.92,
    "Week 3": 142.47,
    "Week 4": 152.16
  },
  {
    "User ID": 723153820145758200,
    "Display Name": "MomentumBln",
    "Team Name": "TetaTet with a Mustardson",
    "Wins": 4,
    "Losses": 4,
    "Ties": 0,
    "Points For": 507,
    "Points Against": 464,
    "Adjusted Average": 125.8,
    "TREND": "NO TREND",
    "Trend Percentage": 3.5,
    "QB Strength": 75,
    "RB Strength": 86,
    "WR Strength": 64,
    "TE Strength": 93,
    "K Strength": 100,
    "QB": "Justin Herbert",
    "RB": "Trey Benson, Cam Skattebo, Bam Knight, Kenneth Walker, Bijan Robinson, Zach Charbonnet",
    "WR": "Ricky Pearsall, Elic Ayomanor, Isaiah Bond, Tetairoa McMillan, Darnell Mooney, Marvin Mims, Kayshon Boutte",
    "TE": "Tyler Warren",
    "K": "Spencer Shrader",
    "DEF": "New England Patriots",
    "POWER RANK": 7,
    "Power Rank Score": 7,
    "COMMENTS": "Ach ja, was willste da noch sagen. Mo hat letztes Jahr, nach eigenen Worten, sein Team kaputt getraded. Dieses Jahr hat er es absolut zerstört. Und das nur durch Injury Pech.\nNabers und Mooney für Egbuka und Wilson, instant beide raus. Nabers sogar für die Season. Chase Brown für Trey Benson, ab auf IR mit dem.\nEs hätte echt kaum schlechter laufen können. Auf der Waiver Wire wird Mo wohl auch nicht mehr die großen Fische ans Land ziehen mit seinem Goose Egg aufm Konto. \nMit etwas Glück und MEHR TRADES landet Mo ja vielleicht wieder auf der Überholspur. Never say never.",
    "Week 1": 138.83,
    "Week 2": 119.93,
    "Week 3": 116.65,
    "Week 4": 131.72
  },
  {
    "User ID": 723213691029368800,
    "Display Name": "jay88",
    "Team Name": "Waddle in the Huddle",
    "Wins": 3,
    "Losses": 5,
    "Ties": 0,
    "Points For": 475,
    "Points Against": 518,
    "Adjusted Average": 118.5,
    "TREND": "DOWN",
    "Trend Percentage": -10.8,
    "QB Strength": 78,
    "RB Strength": 97,
    "WR Strength": 63,
    "TE Strength": 78,
    "K Strength": 76,
    "QB": "Jayden Daniels, Daniel Jones",
    "RB": "Kareem Hunt, Saquon Barkley, J.K. Dobbins, Rhamondre Stevenson, De'Von Achane",
    "WR": "Travis Hunter, Hollywood Brown, Jakobi Meyers, DeVonta Smith, Jaylen Waddle",
    "TE": "Brock Bowers",
    "K": "Jake Bates",
    "DEF": "Philadelphia Eagles",
    "POWER RANK": 12,
    "Power Rank Score": 9.98,
    "COMMENTS": "Ich versteh nicht so ganz warum Jay auf dem letzten Platz in dieser Woche landet, aber ich habe das System gecheckt und alles haut hin. Es muss an den zwei Doppelniederlagen aus den letzten Wochen liegen.\nDie einzige Mannschaft mit einem signifikanten Abwärtstrend. Nach starken Anfang läuft es immer schlecht. Dabei sieht das Team eigentlich ganz gut aus. Vorallem jetzt wo der Namesgeber auch WR1 in seinem Team ist, sollte es doch mehr Punkte geben.\nDiese Woche hat Jay die höchste Projection, zwar ohne einen einzigen BYE, aber immerhin.",
    "Week 1": 128.77,
    "Week 2": 133.1,
    "Week 3": 108.32,
    "Week 4": 105.73
  },
  {
    "User ID": 986549581037002800,
    "Display Name": "flashdw3",
    "Team Name": "Chase me if you can",
    "Wins": 5,
    "Losses": 3,
    "Ties": 0,
    "Points For": 489,
    "Points Against": 493,
    "Adjusted Average": 118,
    "TREND": "NO TREND",
    "Trend Percentage": -2.7,
    "QB Strength": 69,
    "RB Strength": 100,
    "WR Strength": 68,
    "TE Strength": 80,
    "K Strength": 89,
    "QB": "Jared Goff, Joe Burrow",
    "RB": "Tyrone Tracy, Bhayshul Tuten, David Montgomery, Travis Etienne, Javonte Williams",
    "WR": "Rashee Rice, Ladd McConkey, Cooper Kupp, Ja'Marr Chase, Jaxon Smith-Njigba",
    "TE": "Harold Fannin, Dallas Goedert, Kyle Pitts",
    "K": "Brandon Aubrey",
    "DEF": "Denver Broncos",
    "POWER RANK": 8,
    "Power Rank Score": 7.65,
    "COMMENTS": "Was ist da los? Ist dieses Jahr Gegenteiljahr? Sven in der Liga weit oben? Wir erinnern uns alle wie Sven widerwillig Javonte Williams und ETN picken musste, weil es keine anderen RBs mehr gab.\nBesser hätte es für Sven nicht laufen können. Absolute Steals, League Winners, Goldgriffe. \nDafür stinken Joe Burrow, Jamar Chase und Ladd McConkey mal so richtig ab. Die Kollegen haben mal irgendwie absolut kein Bock mitzuspielen.\nWenn mich meine Erinnerung nicht täuscht, dann müsste das Svens bestes Jahr in der THF sein. Hoffentlich bleibts auch so, denn die letzte Woche war nicht vielversprechend. Vielleicht Chase traden, jetzt wo er noch name Value hat?",
    "Week 1": 108.27,
    "Week 2": 147.84,
    "Week 3": 127.68,
    "Week 4": 105.72
  },
  {
    "User ID": 1137349364512510000,
    "Display Name": "sandmann1ps",
    "Team Name": "No Team Name",
    "Wins": 4,
    "Losses": 4,
    "Ties": 0,
    "Points For": 510,
    "Points Against": 493,
    "Adjusted Average": 128.4,
    "TREND": "UP",
    "Trend Percentage": 17.6,
    "QB Strength": 89,
    "RB Strength": 79,
    "WR Strength": 69,
    "TE Strength": 56,
    "K Strength": 62,
    "QB": "Patrick Mahomes",
    "RB": "Bucky Irving, Brian Robinson, Jahmyr Gibbs",
    "WR": "Tre' Harris, Luther Burden, Davante Adams, Tee Higgins, Calvin Austin, Khalil Shakir, Chris Olave",
    "TE": "Jonnu Smith, T.J. Hockenson",
    "K": "Cameron Dicker",
    "DEF": "Detroit Lions",
    "POWER RANK": 4,
    "Power Rank Score": 4.6,
    "COMMENTS": "Nachdem Peter letztes Jahr heldenhaft eingesprungen ist und Felles dreckiges Autopick Team übernommen hat, durfte er dieses Jahr selber draften. Das scheint sich gelohnt zu haben. Auch wenn er davon anscheinend ausging, dass jeder Pick nach der zehnten völlig egal ist, scheint sein Team ziemlich stark zu sein.\nWenn man aber genauer hinschaut, dann fehlt da einiges an Depth. Auf der Bank werden nur selten die 5 Punkte geknackt. Jetzt kommt mit Buckys Verletzung der erste Test in einer Woche mit 3 BYEs.",
    "Week 1": 100.02,
    "Week 2": 128.48,
    "Week 3": 128.26,
    "Week 4": 154
  }
]