[
  {
    "User ID": 716284640708587500,
    "Display Name": "Shpooople",
    "Team Name": "The ImBortles",
    "Wins": 9,
    "Losses": 9,
    "Ties": 0,
    "Points For": 1152,
    "Points Against": 1293,
    "Adjusted Average": 129.2,
    "TREND": "UP",
    "Trend Percentage": 21.4,
    "QB Strength": 85,
    "RB Strength": 76,
    "WR Strength": 96,
    "TE Strength": 59,
    "K Strength": 89,
    "QB": "Joe Flacco, Daniel Jones",
    "RB": "Omarion Hampton, TreVeyon Henderson, Kyle Monangai, Derrick Henry, Rico Dowdle",
    "WR": "Jayden Reed, Troy Franklin, Keenan Allen, DJ Moore, Drake London, George Pickens",
    "TE": "Harold Fannin, Mark Andrews",
    "K": "Eddy Pineiro",
    "DEF": "Detroit Lions",
    "POWER RANK": 3,
    "Power Rank Score": 3.3,
    "COMMENTS": "Ich bin kurz davor, meinen Rico-Schrein zu bauen. Eine 30er-Performance brauche ich aber noch. Die Hingle-McCringleberry-Celebration macht ihn noch mal deutlich sympathischer.\nAber mein Team ist generell der Heimathafen der RB-„2“-Overperformer. Nach Rico Suave macht Kyle MononDUDE das Spiel seines Lebens und erarbeitet sich vielleicht einen 50/50-Split im Bears-Backfield. Budget-Knuckles, sozusagen. Kommt jetzt noch der Hendo-30-Burger? Mein Team wird vermutlich nicht noch mal 180 Punkte machen – schade eigentlich. Es scheint aber so, als würden einige Spieler endlich Fahrt aufnehmen. Zum Glück habe ich diese ganzen Trades nicht angenommen bzw. durchgezogen.",
    "Week 1": 118.38,
    "Week 2": 67.93,
    "Week 3": 127.73,
    "Week 4": 132.26,
    "Week 5": 134.32,
    "Week 6": 141.1,
    "Week 7": 122.67,
    "Week 8": 127.68,
    "Week 9": 180.38
  },
  {
    "User ID": 718519453150679000,
    "Display Name": "Sternburg1000",
    "Team Name": "Always sunny´n Scarycity",
    "Wins": 4,
    "Losses": 14,
    "Ties": 0,
    "Points For": 1044,
    "Points Against": 1117,
    "Adjusted Average": 115.1,
    "TREND": "DOWN",
    "Trend Percentage": -11.5,
    "QB Strength": 88,
    "RB Strength": 66,
    "WR Strength": 64,
    "TE Strength": 39,
    "K Strength": 84,
    "QB": "Bo Nix",
    "RB": "Chris Rodriguez, Nick Chubb, Tony Pollard, Devin Singletary, Jaret Patterson, Kyren Williams",
    "WR": "Terry McLaurin, Jerry Jeudy, Amon-Ra St. Brown, Zay Flowers",
    "TE": "Darren Waller, George Kittle",
    "K": "Jason Myers",
    "DEF": "Buffalo Bills, Los Angeles Rams",
    "POWER RANK": 12,
    "Power Rank Score": 11,
    "COMMENTS": "Hat jemand mal was von Lücke gehört? Früher ist er immer zum Spielen vorbeigekommen und ist dann auf der Couch eingeschlafen – jetzt ruht er sich vermutlich auf seiner Championship-Season aus. Aber immer noch ohne Ring. Dabei ist der so schön geworden.\nWenn mich nicht alles täuscht, lief das nach seinem ersten Chip ähnlich ab. Leider war das noch bei ESPN ... kann ich nicht nachgucken ... naja, wird schon stimmen. Wem könnte man in Lückes Team die Schuld geben? Vielleicht Scary Terry und Kittle, die beide länger verletzt waren bzw. sind ... oder Zay Flowers, der lange Zeit mit schlechten QBs klarkommen musste. Irgendwie sieht die Truppe auch nicht so geil aus. Die 12 FAAB, die Lücke noch auf der hohen Kante hat, lassen zumindest darauf schließen, dass er versucht, sein Team zu verbessern. Am Tabellenende macht Lücke aktuell auf jeden Fall die wenigsten Punkte, und die Voodoo Magic scheint verblasst zu sein. Die Playoffs rücken so langsam außer Reichweite.",
    "Week 1": 112.09,
    "Week 2": 133.79,
    "Week 3": 106.92,
    "Week 4": 122.89,
    "Week 5": 129.48,
    "Week 6": 104.76,
    "Week 7": 109.71,
    "Week 8": 114.58,
    "Week 9": 110.07
  },
  {
    "User ID": 718524962947801100,
    "Display Name": "Schleckeracci",
    "Team Name": "The Founding Fathers",
    "Wins": 6,
    "Losses": 12,
    "Ties": 0,
    "Points For": 1087,
    "Points Against": 1121,
    "Adjusted Average": 122.2,
    "TREND": "NO TREND",
    "Trend Percentage": -0.7,
    "QB Strength": 77,
    "RB Strength": 61,
    "WR Strength": 72,
    "TE Strength": 100,
    "K Strength": 82,
    "QB": "Matthew Stafford, Lamar Jackson",
    "RB": "Woody Marks, RJ Harvey, Joe Mixon, Jaylen Warren",
    "WR": "Tre Tucker, Brian Thomas, Keon Coleman, Justin Jefferson, Romeo Doubs",
    "TE": "Hunter Henry, Trey McBride",
    "K": "Chase McLaughlin",
    "DEF": "Indianapolis Colts, Jacksonville Jaguars",
    "POWER RANK": 10,
    "Power Rank Score": 8.72,
    "COMMENTS": "Sie galten nach sechs Wochen als Topfavorit für den letzten Platz, doch die Founding Fathers haben so langsam ihren Rhythmus gefunden. Diese Woche sind sie knapp am Median vorbeigerutscht, was sich auf die Entscheidung zurückschließen lässt, dass sie Tre Tucker statt RJ Harvey aufgestellt haben.\nWürde man denken, wenn man Till am Sonntag zugehört hat – aber der eigentliche Fehler war Joshua Karty. Warum stellt man denn den Kicker #28 auf? Sleeper Projection? Collusion? Gibt’s jetzt Ärger im Gründerviertel?\nIch hoffe doch nicht.",
    "Week 1": 101.16,
    "Week 2": 115.95,
    "Week 3": 128.67,
    "Week 4": 131.08,
    "Week 5": 126.51,
    "Week 6": 92.49,
    "Week 7": 139.78,
    "Week 8": 135.12,
    "Week 9": 116.79
  },
  {
    "User ID": 718516055202418700,
    "Display Name": "kobekope",
    "Team Name": "Alvin had a little Lamb",
    "Wins": 9,
    "Losses": 9,
    "Ties": 0,
    "Points For": 1141,
    "Points Against": 1092,
    "Adjusted Average": 127.2,
    "TREND": "DOWN",
    "Trend Percentage": -9.4,
    "QB Strength": 91,
    "RB Strength": 75,
    "WR Strength": 72,
    "TE Strength": 98,
    "K Strength": 0,
    "QB": "Drake Maye, Dak Prescott",
    "RB": "Alvin Kamara, Aaron Jones, Tyler Allgeier, Rachaad White, James Cook",
    "WR": "Courtland Sutton, Deebo Samuel, CeeDee Lamb, Rashid Shaheed, Josh Downs",
    "TE": "Jake Ferguson",
    "K": "Michael Badgley",
    "DEF": "Baltimore Ravens",
    "POWER RANK": 7,
    "Power Rank Score": 7,
    "COMMENTS": "„Ich glaube, die Saints gewinnen dieses Jahr kein Spiel mehr.“ – die Worte eines Fans, dessen Team Jahr für Jahr die Capspace-Probleme aufs nächste Jahr verschoben hat.\nDarum kümmern sich die Zukunfts-Saints. Tja, die Zukunfts-Saints sind in der Gegenwart angekommen – und so ist auch Köppis Team. Kamara hat in den letzten drei Games 10 Punkte gemacht. CeDee ist productive, aber weit von den Glory Days entfernt. Fergie hat in den letzten zwei Partien auch nur sechs Punkte gemacht. Und trotzdem hat es für einen Win in Woche 9 gereicht. Glück im Unglück sozusagen. Es fehlt irgendwas, aber ich kann es nicht ausmachen. Das Roster sieht eigentlich gut aus. Naja, vielleicht hilft ja der Shaheed-Trade zu den Seahawks.",
    "Week 1": 132.37,
    "Week 2": 139.89,
    "Week 3": 116.24,
    "Week 4": 147.82,
    "Week 5": 150.47,
    "Week 6": 100.34,
    "Week 7": 124.41,
    "Week 8": 114.07,
    "Week 9": 115.86
  },
  {
    "User ID": 718795712124510200,
    "Display Name": "pk123",
    "Team Name": "No Team Name",
    "Wins": 10,
    "Losses": 8,
    "Ties": 0,
    "Points For": 1143,
    "Points Against": 1080,
    "Adjusted Average": 126.9,
    "TREND": "DOWN",
    "Trend Percentage": -8.4,
    "QB Strength": 67,
    "RB Strength": 74,
    "WR Strength": 66,
    "TE Strength": 78,
    "K Strength": 68,
    "QB": "Sam Darnold",
    "RB": "Jacory Croskey-Merritt, Josh Jacobs, Chuba Hubbard",
    "WR": "Malik Washington, Marvin Harrison, Ricky Pearsall, Chris Godwin, Brandon Aiyuk, Nico Collins, Rashod Bateman, Puka Nacua",
    "TE": "Sam LaPorta, Zach Ertz",
    "K": "Tyler Loop",
    "DEF": "Green Bay Packers",
    "POWER RANK": 6,
    "Power Rank Score": 6.12,
    "COMMENTS": "Nach zwei Wochen mit zusammengerechnet 180 Punkten (pah, sowas mach ich doch in einer) hat Philipps Truppe wieder eine Glanzleistung hingelegt. 148 Punkte mit freundlichen Grüßen von Sam „MVP Candidate“ Darnold in Lückes Gesicht. Das macht doch Hoffnungen auf mehr.\nMHJ hat jetzt endlich einen QB, der legal Achterbahn fahren darf, und zieht sofort DaRon Bland die Schuhe in der Endzone aus. Wer den Trade mit Tine gewonnen hat, wird sich noch herausstellen, aber Chuba hat als neuer RB2 in Carolina direkt mal 1,65 Punkte ausgepackt. Da muss Nico schon was zeigen, um den Trade auszubügeln – ich bin gespannt.",
    "Week 1": 136.67,
    "Week 2": 120.75,
    "Week 3": 105.26,
    "Week 4": 170.6,
    "Week 5": 140.25,
    "Week 6": 134.75,
    "Week 7": 102.72,
    "Week 8": 84.32,
    "Week 9": 148.15
  },
  {
    "User ID": 722748718910083100,
    "Display Name": "TinyDancerTiez",
    "Team Name": "Chubaker",
    "Wins": 6,
    "Losses": 12,
    "Ties": 0,
    "Points For": 1082,
    "Points Against": 1243,
    "Adjusted Average": 119.7,
    "TREND": "DOWN",
    "Trend Percentage": -13.9,
    "QB Strength": 66,
    "RB Strength": 67,
    "WR Strength": 88,
    "TE Strength": 44,
    "K Strength": 51,
    "QB": "Jared Goff, Baker Mayfield",
    "RB": "Isaiah Davis, D'Andre Swift, Breece Hall, Isiah Pacheco, Tyjae Spears",
    "WR": "Emeka Egbuka, Darius Slayton, Michael Pittman, Garrett Wilson, Parker Washington, Quentin Johnston",
    "TE": "Colston Loveland",
    "K": "Brandon McManus",
    "DEF": "Seattle Seahawks",
    "POWER RANK": 11,
    "Power Rank Score": 10.22,
    "COMMENTS": "Der Pakt mit dem Teufel zeigt seine Schattenseite. Wer mit Tine tradet, muss damit rechnen, dass definitiv ein Spieler sich verletzt – egal für welchen Tradepartner. Das jüngste Opfer ist Cam Skattebo ... Bein, ab. Dazu kommt, dass Swift auch direkt nach ihrem Trade plötzlich nicht mehr durch die Injury spielt und den Weg frei macht für Monangai. Danke dafür übrigens, D’Andre.\nDabei hat Tine ihr persönliches BYEMAGEDDON, weil sie fünf Spieler von zwei Teams hat, die gleichzeitig BYE haben. Jetzt kommen aber alle wieder, und ich glaube, Tines Truppe könnte noch einen Push zu den Playoffs machen, wenn Baker wieder klarkommt und die Jets nicht gegen gute Defenses spielen. Eine Teamumbenennung steht noch an – jetzt, wo Chuba nicht mehr da ist und Spears und Swift einen Running-Back-Room bilden.",
    "Week 1": 114.08,
    "Week 2": 138.45,
    "Week 3": 115.57,
    "Week 4": 138.81,
    "Week 5": 144.01,
    "Week 6": 100.04,
    "Week 7": 112.67,
    "Week 8": 113.39,
    "Week 9": 105.11
  },
  {
    "User ID": 723145047784116200,
    "Display Name": "oppossumfrank",
    "Team Name": "Pandan Buns",
    "Wins": 13,
    "Losses": 5,
    "Ties": 0,
    "Points For": 1244,
    "Points Against": 1096,
    "Adjusted Average": 139.1,
    "TREND": "NO TREND",
    "Trend Percentage": 3.1,
    "QB Strength": 84,
    "RB Strength": 100,
    "WR Strength": 66,
    "TE Strength": 74,
    "K Strength": 92,
    "QB": "Jalen Hurts",
    "RB": "Emari Demercado, Bhayshul Tuten, Ashton Jeanty, Jonathan Taylor, Jordan Mason",
    "WR": "Rome Odunze, Xavier Worthy, Tez Johnson, Mike Evans, Jauan Jennings, Wan'Dale Robinson, Jameson Williams",
    "TE": "Dalton Kincaid",
    "K": "Chris Boswell",
    "DEF": "Carolina Panthers",
    "POWER RANK": 2,
    "Power Rank Score": 3.2,
    "COMMENTS": "Vor zwei Wochen habe ich es noch prognostiziert – jetzt kam die erste Sub-100-Woche seit Woche 1 von Leos Team. Nach sieben Wochen mit mindestens 130 Punkten jetzt das erste Mal zweistellig.\nWoran hat’s gelegen?\nRome Odunze – more like 0dunze. Hurts im BYE, Tucker Kraft ACL, JT mit 3 YPC. Kaum machen Jamo und Jeanty mal Punkte, machen die anderen Mittagsschlaf. Es sieht wohl sehr nach einem flukey Ergebnis in Woche 9 aus.\nKraft ist natürlich ein herber Verlust, aber Leo hat zum Glück noch einen Stud-TE auf der Bank.\nKommt jetzt die Bounce-Back-Woche gegen die Founding Fathers, oder beginnt ein Abwärtstrend?",
    "Week 1": 93.13,
    "Week 2": 153.44,
    "Week 3": 177.79,
    "Week 4": 143.25,
    "Week 5": 131,
    "Week 6": 137.87,
    "Week 7": 146.49,
    "Week 8": 166.06,
    "Week 9": 95.5
  },
  {
    "User ID": 1127992026114461700,
    "Display Name": "benjyalf",
    "Team Name": "Addison Rae",
    "Wins": 9,
    "Losses": 9,
    "Ties": 0,
    "Points For": 1119,
    "Points Against": 1161,
    "Adjusted Average": 125.7,
    "TREND": "NO TREND",
    "Trend Percentage": -5.4,
    "QB Strength": 88,
    "RB Strength": 93,
    "WR Strength": 69,
    "TE Strength": 92,
    "K Strength": 59,
    "QB": "Caleb Williams, Josh Allen",
    "RB": "Kimani Vidal, Quinshon Judkins, Christian McCaffrey, Kenneth Gainwell",
    "WR": "DK Metcalf, A.J. Brown, Alec Pierce, Kayshon Boutte, Jordan Addison",
    "TE": "Travis Kelce, Juwan Johnson",
    "K": "Cairo Santos",
    "DEF": "Cleveland Browns",
    "POWER RANK": 8,
    "Power Rank Score": 7.2,
    "COMMENTS": "Irgendwie hat Ben aktuell den Injury Bug. Judkins, Brown und Boutte sind alle raus. Dazu gab’s diese Woche noch extrem schlechte Performances von Metcalf und Vidal.\nGenerell ist Bens All-Star-Team ziemlich inkonsistent ... zu viele Divas im Locker Room? Wenn sich die Jungs von Ben erholen, wird’s richtig schwer, gegen ihn zu gewinnen. Ich sehe keine einzige Schwachstelle. Die RBs sind z. B. sehr stark, wobei Judkins deutlich unter der Browns-Offense leidet und Vidal an Value verlieren wird, sobald Hampton wiederkommt – auch wenn der Verlust von LT Joe Alt generell für weniger Production bei den Chargers sorgen wird.\nGenerell würde ich mir aber an Bens Stelle relativ wenig Sorgen machen. Im Gegensatz zum letzten Jahr spielt Ben auch richtig mit, weil er nicht den perfektesten Draft der Geschichte hatte. Da gönnt man ihm auch mehr die Punkte.",
    "Week 1": 108.76,
    "Week 2": 86.92,
    "Week 3": 142.47,
    "Week 4": 152.16,
    "Week 5": 114.42,
    "Week 6": 131.35,
    "Week 7": 142.78,
    "Week 8": 119.12,
    "Week 9": 121.02
  },
  {
    "User ID": 723153820145758200,
    "Display Name": "MomentumBln",
    "Team Name": "TetaTet with a Mustardson",
    "Wins": 10,
    "Losses": 8,
    "Ties": 0,
    "Points For": 1138,
    "Points Against": 1164,
    "Adjusted Average": 128,
    "TREND": "NO TREND",
    "Trend Percentage": 2.7,
    "QB Strength": 92,
    "RB Strength": 79,
    "WR Strength": 56,
    "TE Strength": 95,
    "K Strength": 100,
    "QB": "Justin Herbert",
    "RB": "Trey Benson, Tyrone Tracy, Kenneth Walker, Chase Brown, Bijan Robinson, Zach Charbonnet",
    "WR": "Elic Ayomanor, Tetairoa McMillan, Stefon Diggs, Darnell Mooney, Christian Watson",
    "TE": "Tyler Warren",
    "K": "Cam Little, Ka'imi Fairbairn",
    "DEF": "New England Patriots",
    "POWER RANK": 4,
    "Power Rank Score": 5.28,
    "COMMENTS": "Mo hat vielleicht das konstanteste Team der Liga. In den letzten vier Wochen hat seine Truppe immer zwischen 125 und 138 Punkten abgeliefert.\nZu verdanken hat er das dem Boyfriend Madison Beer. Wer ist Madison Beer? Absolut keine Ahnung, aber jedes NFL-Media-Outlet erzählt es mir täglich.\nJustin hat jedenfalls einen richtigen Fantasy-Run – vor allem, weil er so viel auf dem Feld rennt. Leading Rusher amongst QBs in 2025. Der Kollege hat 38, 34 und 34 Punkte in den letzten drei Wochen gemacht. Crazy. Dafür hat Bijan in der gleichen Zeit insgesamt 38 Punkte gemacht. Tyler Warren war auch nur mit 28 Punkten in den letzten drei Wochen dabei. Da muss Mo wohl ordentlich im Olympiastadion anfeuern, damit die auch wieder OPOY- und OROY-Performances auspacken.",
    "Week 1": 138.83,
    "Week 2": 119.93,
    "Week 3": 116.65,
    "Week 4": 131.72,
    "Week 5": 104.04,
    "Week 6": 128.16,
    "Week 7": 138.8,
    "Week 8": 134.88,
    "Week 9": 125.8
  },
  {
    "User ID": 723213691029368800,
    "Display Name": "jay88",
    "Team Name": "Waddle in the Huddle",
    "Wins": 11,
    "Losses": 7,
    "Ties": 0,
    "Points For": 1139,
    "Points Against": 1078,
    "Adjusted Average": 125.1,
    "TREND": "UP",
    "Trend Percentage": 18.7,
    "QB Strength": 65,
    "RB Strength": 96,
    "WR Strength": 72,
    "TE Strength": 70,
    "K Strength": 69,
    "QB": "Jayden Daniels, Jaxson Dart",
    "RB": "Kareem Hunt, Saquon Barkley, J.K. Dobbins, Rhamondre Stevenson, De'Von Achane",
    "WR": "Tory Horton, Travis Hunter, Jakobi Meyers, DeVonta Smith, Jaylen Waddle",
    "TE": "Brock Bowers, Oronde Gadsden",
    "K": "Jake Bates",
    "DEF": "Houston Texans, Philadelphia Eagles",
    "POWER RANK": 5,
    "Power Rank Score": 5.4,
    "COMMENTS": "Alle Zeichen zeigen nach oben für Jays Gang. 143 ohne seine Eagles, Saquon und Devonta. Das ist schon beachtlich.\nJaxon Dart spielt so aggressiv – vor allem im Running Game –, dass man bei jedem Run Angst hat, dass er sich verletzen wird. Und er wird es noch tun, 100 %, die Frage ist nur wann.\nJays Team hat keine Schwachstelle. In den letzten zwei Wochen legt Jay einen 150er Schnitt hin. Wenn es dabei bleibt, können wir uns alle – auch Sven – warm anziehen.\nDiese Woche treffen wir beide auf einander. Die beiden Teams mit dem höchsten TREND Werten aus den Powerrankings. Könnte ein spannendes Match werden.",
    "Week 1": 128.77,
    "Week 2": 133.1,
    "Week 3": 108.32,
    "Week 4": 105.73,
    "Week 5": 133.54,
    "Week 6": 105.71,
    "Week 7": 122.74,
    "Week 8": 157.97,
    "Week 9": 143.19
  },
  {
    "User ID": 986549581037002800,
    "Display Name": "flashdw3",
    "Team Name": "Chase me if you can",
    "Wins": 14,
    "Losses": 4,
    "Ties": 0,
    "Points For": 1254,
    "Points Against": 1133,
    "Adjusted Average": 139.6,
    "TREND": "UP",
    "Trend Percentage": 9.6,
    "QB Strength": 20,
    "RB Strength": 85,
    "WR Strength": 100,
    "TE Strength": 83,
    "K Strength": 94,
    "QB": "J.J. McCarthy, Joe Burrow",
    "RB": "David Montgomery, Travis Etienne, Javonte Williams",
    "WR": "Rashee Rice, Xavier Legette, Ladd McConkey, Cooper Kupp, Ja'Marr Chase, Jaxon Smith-Njigba",
    "TE": "Dallas Goedert, Kyle Pitts",
    "K": "Brandon Aubrey, Nick Folk",
    "DEF": "Denver Broncos",
    "POWER RANK": 1,
    "Power Rank Score": 1.9,
    "COMMENTS": "„Most Points in Loss“ und „Biggest Blowout“ sieht man auch nicht oft beim gleichen Team im Weekly Report – genauso wenig wie 42,5 Punkte vom QB in einem Loss. Vor Woche 9 hatte Sven als Tabellenführer bislang die wenigsten Points Against. Das hat sich zum Glück geändert.\nDoch jetzt kommt die zweite fette BYE-Week für Sven. Kyle Pitts und Xavier Legette in den Flex-Spots. Sexy.\nWäre ja ganz nett, wenn das Superteam etwas „back to Earth“ kommen würde. Ich würde es jedenfalls begrüßen.",
    "Week 1": 108.27,
    "Week 2": 147.84,
    "Week 3": 127.68,
    "Week 4": 105.72,
    "Week 5": 171.14,
    "Week 6": 161.97,
    "Week 7": 153.49,
    "Week 8": 139.52,
    "Week 9": 138.65
  },
  {
    "User ID": 1137349364512510000,
    "Display Name": "sandmann1ps",
    "Team Name": "No Team Name",
    "Wins": 7,
    "Losses": 11,
    "Ties": 0,
    "Points For": 1140,
    "Points Against": 1104,
    "Adjusted Average": 122.8,
    "TREND": "DOWN",
    "Trend Percentage": -12.1,
    "QB Strength": 100,
    "RB Strength": 59,
    "WR Strength": 88,
    "TE Strength": 50,
    "K Strength": 96,
    "QB": "Patrick Mahomes, Aaron Rodgers",
    "RB": "Emanuel Wilson, Bucky Irving, Samaje Perine, Jahmyr Gibbs",
    "WR": "Davante Adams, Tee Higgins, Calvin Austin, Khalil Shakir, Chris Olave",
    "TE": "Jonnu Smith, T.J. Hockenson",
    "K": "Cameron Dicker",
    "DEF": "Los Angeles Chargers",
    "POWER RANK": 9,
    "Power Rank Score": 8.65,
    "COMMENTS": "Peterle, ich wollte mich in dem Text nur noch mal für Woche 7 bedanken. Ummantelt von vier < 120-Wochen gab’s die fette 180er-Packung für mich.\nDie Truppe von Svens Kumpel, der angeblich jünger ist als wir (obwohl ich die ganze Zeit davon ausgegangen bin, dass er Mitte 40 ist), macht auf dem Blatt eigentlich viel her.\nMahomes ist QB1, Gibbs ist nicht ganz so geil wie letztes Jahr, aber immer noch Top 10. Davante Adams ist stabil, Tee Higgins dreht komplett durch mit Joe Flacco als QB, und er hat auch den genausten Kicker der NFL-Geschichte im Team. Wo ist das Problem? Es fehlt an Depth und TEs. Hockenson ist Drop-Material, und die Waiver Wire hat wöchentlich Besseres zu bieten. Greif zu, Peter.",
    "Week 1": 100.02,
    "Week 2": 128.48,
    "Week 3": 128.26,
    "Week 4": 154,
    "Week 5": 116.27,
    "Week 6": 109.73,
    "Week 7": 180.29,
    "Week 8": 107.16,
    "Week 9": 115.85
  }
]