[
  {
    "User ID": 716284640708587500,
    "Display Name": "Shpooople",
    "Team Name": "Dobbins is free!",
    "Wins": 11,
    "Losses": 5,
    "Ties": 0,
    "Points For": 1076,
    "Points Against": 988,
    "Adjusted Average": 135.8,
    "TREND": "DOWN",
    "Trend Percentage": -9.9,
    "QB Strength": 76,
    "RB Strength": 77,
    "WR Strength": 100,
    "TE Strength": 58,
    "K Strength": 95,
    "QB": "Jayden Daniels",
    "RB": "Kareem Hunt, David Montgomery, J.K. Dobbins, Jerome Ford, Isiah Pacheco",
    "WR": "Jayden Reed, Adam Thielen, Mike Evans, Terry McLaurin, Justin Jefferson, Darnell Mooney",
    "TE": "T.J. Hockenson, Cole Kmet",
    "K": "Austin Seibert",
    "DEF": "Cleveland Browns, Pittsburgh Steelers",
    "Week 1": 164.47,
    "Week 2": 123.49,
    "Week 3": 97.41,
    "Week 4": 152.32,
    "Week 5": 140.07,
    "Week 6": 150.56,
    "Week 7": 105.54,
    "Week 8": 143.11,
    "POWER RANK": 2,
    "Power Rank Score": 3.4,
    "COMMENTS": "Bounce Back Week. Auch wenn es ein Hail Maryland, einen throwing TD von Monty und einen Punt Return TD gebraucht hat. Fantasy is halt 80% Luck. \nKlar, ich hab auch ein paar hundert Mock Drafts gemacht und \"verschwende\" jeden Tage bestimmt eine gute Stunde mit Fantasy Football bullshit, aber am Ende des Tages ist es nunmal pures Glück.\nNach 8 Wochen fünfmal über 140 Punkte machen, sichert mir erstmal einen Platz in den Top 3. Famous last words."
  },
  {
    "User ID": 718519453150679000,
    "Display Name": "Sternburg1000",
    "Team Name": "Apukalipse Now!",
    "Wins": 8,
    "Losses": 8,
    "Ties": 0,
    "Points For": 874,
    "Points Against": 945,
    "Adjusted Average": 112,
    "TREND": "DOWN",
    "Trend Percentage": -19,
    "QB Strength": 49,
    "RB Strength": 59,
    "WR Strength": 57,
    "TE Strength": 54,
    "K Strength": 85,
    "QB": "Patrick Mahomes",
    "RB": "Tyrone Tracy, Jonathan Taylor, James Cook",
    "WR": "DeAndre Hopkins, Tee Higgins, Jaylen Waddle, Puka Nacua, Zay Flowers",
    "TE": "Zach Ertz, Jake Ferguson, Isaiah Likely",
    "K": "Brandon Aubrey",
    "DEF": "New York Jets, Washington Commanders",
    "Week 1": 98.81,
    "Week 2": 127.92,
    "Week 3": 144.96,
    "Week 4": 93.09,
    "Week 5": 129.58,
    "Week 6": 94.17,
    "Week 7": 57.36,
    "Week 8": 128.48,
    "POWER RANK": 9,
    "Power Rank Score": 9.28,
    "COMMENTS": "Nach einer der schlechtesten Wochen in der Geschichte der Hanson Family, hat Lücke seine Chance gegen Tills lädierte Lumpentruppe eiskalt genutzt. \n80% seiner Punkte wurden von den QB, RB und WR Startern gemacht. Der Rest hat sich nobel zurück gehalten. Lediglich RB Benchwarmer of the Week Tyron Tracy hat auf der Bank noch mitgespielt.\nTracy könnte der Waiver Wire win der Season sein, wenn er so weiter macht, wie gegen den West-Atlantischen Betriebsverein der IGM Metall. \nZwei wins in Woche 8 sind für Max wohl nur halb so eine Freude, wie die Nachricht dass AR in Indy endlich seinen wohlverdienten Platz auf der Bank findet. Lücke hasst AR.\nJetzt wird Jonathan Taylor vielleicht so richtig unleashed. Der RB mit der höchsten explosive Run Rate wird durch die Turnover des first round picks aus 2023 bislang eher zurück gehalten. \nWas bringt die Zukunft für die Apukalipse? Eine weitere Punktesteigerung von über 250%, wie in Woche 8, ist vermutlich unrealistisch, aber man wird ja noch träumen dürfen."
  },
  {
    "User ID": 718524962947801100,
    "Display Name": "Schleckeracci",
    "Team Name": "Brijaleon Daltallen Jr.",
    "Wins": 8,
    "Losses": 8,
    "Ties": 0,
    "Points For": 994,
    "Points Against": 1047,
    "Adjusted Average": 125,
    "TREND": "NO TREND",
    "Trend Percentage": 0.5,
    "QB Strength": 76,
    "RB Strength": 93,
    "WR Strength": 82,
    "TE Strength": 50,
    "K Strength": 71,
    "QB": "Josh Allen",
    "RB": "Kimani Vidal, Najee Harris, Brian Robinson, Bijan Robinson",
    "WR": "Xavier Legette, Ricky Pearsall, Demarcus Robinson, Chris Godwin, Calvin Ridley, DK Metcalf, Wan'Dale Robinson",
    "TE": "Dalton Kincaid",
    "K": "Chase McLaughlin",
    "DEF": "Green Bay Packers, Houston Texans",
    "Week 1": 138.13,
    "Week 2": 117.36,
    "Week 3": 123.37,
    "Week 4": 97.95,
    "Week 5": 121.49,
    "Week 6": 146.6,
    "Week 7": 129.82,
    "Week 8": 119.67,
    "POWER RANK": 4,
    "Power Rank Score": 4.97,
    "COMMENTS": "Wann kommt endlich die Umbennung? Der Robinson Club hat mittlerweile vier Mitgleider, Braelon Allen und Dalton Schultz sind schon länger nicht mehr dabei und der Teamname ist immernoch der gleiche.\nDie acht Free Agent Moves aus Woche 8 haben nur für eine mittelprächtige Ausbeute gesorgt. Leistungsträger Nummer 1 aus den letzten drei Wochen ist der überragende Najee Harris. Jeweils die 100 Yards geknackt und dazu zwei Toddies. Der hat sich die Bye Week redlich verdient und landet vielleicht sogar auf der Draft again Liste. Calvin Ridley fühlt sich im Robinson Club auch richtig wohl und konnte direkt 8 von 15 Targets fangen. Mal schauen ob das so bleibt. Wäre ganzschön ärgerlich für den Vorbesitzer.\nAuch ohne Godwin ist die Truppe nicht aus dem Playoff-Rennen. Außerdem wäre es einfach schön zu sehen wenn ein Borderline Meme-Team mit vier gleichnamigen Spielern eine Woche gewinnt."
  },
  {
    "User ID": 718516055202418700,
    "Display Name": "kobekope",
    "Team Name": "Kamara Hallis",
    "Wins": 8,
    "Losses": 8,
    "Ties": 0,
    "Points For": 1042,
    "Points Against": 942,
    "Adjusted Average": 126.8,
    "TREND": "NO TREND",
    "Trend Percentage": -0.2,
    "QB Strength": 70,
    "RB Strength": 82,
    "WR Strength": 59,
    "TE Strength": 100,
    "K Strength": 94,
    "QB": "Kyler Murray",
    "RB": "Alvin Kamara, Breece Hall, Jaylen Warren",
    "WR": "Keenan Allen, Davante Adams, Cooper Kupp, Jerry Jeudy, Jalen Tolbert, Khalil Shakir",
    "TE": "George Kittle, Taysom Hill, Dallas Goedert",
    "K": "Ka'imi Fairbairn",
    "DEF": "Kansas City Chiefs",
    "Week 1": 141.83,
    "Week 2": 188.54,
    "Week 3": 102.83,
    "Week 4": 92.93,
    "Week 5": 121.25,
    "Week 6": 134.61,
    "Week 7": 122.65,
    "Week 8": 137.58,
    "POWER RANK": 5,
    "Power Rank Score": 5.03,
    "COMMENTS": "Nachdem sich Felix wochenlang Sorgen um Kyler gemacht hat, zeigt dieser endlich malwieder sein volles Potenzial. Diese Woche gegen die Bears, hat er aber ein unangenehmes Matchup. Aprospors unangenehm: ähnlich wie ich hat er auch gegen die Eagles den kürzeren gezogen. Scheiß Cincinati Defense.\nMit 137 Punkten aus Woche 8 kann man sich aber nicht beschweren. Gelobt sei das extra Match gegen den Median. Da tut der 2 Punkte Loss gegen AFK-Ben nicht ganz so weh. Das Team mit dem stärksten Tight End der Liga (real life und fantasy) scheint sich stabilisert zu haben. Devante Adams zu den Jets ist aber eher ein Downer. Man kann die Jets einfach nur hassen. Dafür kann Shakir seit dem Cooper trade endlich voll aufspielen. Die Bank ist aber ganz schön dünn besetzt und hat nur Jeudy mit einer Projections von über 10 Punkten."
  },
  {
    "User ID": 718795712124510200,
    "Display Name": "pk123",
    "Team Name": "No Team Name",
    "Wins": 8,
    "Losses": 8,
    "Ties": 0,
    "Points For": 1019,
    "Points Against": 966,
    "Adjusted Average": 123.6,
    "TREND": "UP",
    "Trend Percentage": 15.1,
    "QB Strength": 56,
    "RB Strength": 92,
    "WR Strength": 76,
    "TE Strength": 82,
    "K Strength": 67,
    "QB": "Sam Darnold, Jordan Love",
    "RB": "Bucky Irving, Raheem Mostert, Joe Mixon, Jahmyr Gibbs",
    "WR": "Marvin Harrison, Stefon Diggs, Hollywood Brown, Jakobi Meyers, Jauan Jennings, George Pickens, Dontayvion Wicks, Jordan Addison",
    "TE": "Brock Bowers",
    "K": "Cameron Dicker",
    "DEF": "Baltimore Ravens",
    "Week 1": 122.15,
    "Week 2": 125.24,
    "Week 3": 118.96,
    "Week 4": 111.15,
    "Week 5": 116.76,
    "Week 6": 142.32,
    "Week 7": 166.5,
    "Week 8": 116.19,
    "POWER RANK": 6,
    "Power Rank Score": 5.12,
    "COMMENTS": "Eine Woche 166 Punkte machen und in der nächsten Woche gegen Sven verlieren. Fantasy ist schon eine wilde Achterbahnfahrt der Gefühle, das sag ich euch. Woran hats gelegen?\nJordan Love mit 7, Cincy mit -4 Punkten und dazu noch 25 Punkte auf der Bank gelassen. Diese unterirdische Ciny D. Wenn man nur eine Bonafide Monster D haben würde, wie z.B. die Broncos. Das wäre ja was. Mixon und Gibbs sind die beste RB Combo in der Liga.\nLetzte Woche hatte ich noch geschrieben wie PK von schweren Verletzungen verschont geblieben ist. Naja, Dank seiner gut ausgestatten Bank, kann PK den Verlust von Diggs ganz gut ausgleichen."
  },
  {
    "User ID": 722748718910083100,
    "Display Name": "TinyDancerTiez",
    "Team Name": "Gimme Moore",
    "Wins": 7,
    "Losses": 9,
    "Ties": 0,
    "Points For": 1037,
    "Points Against": 1026,
    "Adjusted Average": 126.3,
    "TREND": "DOWN",
    "Trend Percentage": -16.6,
    "QB Strength": 88,
    "RB Strength": 100,
    "WR Strength": 81,
    "TE Strength": 67,
    "K Strength": 77,
    "QB": "Baker Mayfield",
    "RB": "Derrick Henry, Nick Chubb, Zack Moss, Chuba Hubbard, Keaton Mitchell",
    "WR": "Cedric Tillman, DJ Moore, Courtland Sutton, Darius Slayton, Nico Collins, Garrett Wilson",
    "TE": "Dalton Schultz, Trey McBride",
    "K": "Younghoe Koo",
    "DEF": "Chicago Bears, San Francisco 49ers",
    "Week 1": 88.92,
    "Week 2": 115.85,
    "Week 3": 123.46,
    "Week 4": 191.05,
    "Week 5": 160.15,
    "Week 6": 132.55,
    "Week 7": 103.55,
    "Week 8": 122.07,
    "POWER RANK": 8,
    "Power Rank Score": 6.55,
    "COMMENTS": "Mit dem längsten Losingstreak der Liga muss Tine vielleicht die Fantasy Religion wechseln und zu neuen Göttern beten. Obwohl Tine bereits im 1000 Punkte Club rangiert, ist sie auf den neunten Platz abgerutscht.\nSuprisestat of the Week: Garret Wilson ist WR 7 der Season. Dazu kommt noch Derrick Henry der mehr Punkte als 95% der QBs macht. Nur Lamar und Baker, der ja auch in Tines Team ist, machen mehr Punkte. Chuba fucking Hubbard ist RB 14.\nWer versaut Tine hier die Games? Koo Deng kann es ja nicht sein! Anscheinend fehlt es einfach an Konstanz.... und Nico Collins."
  },
  {
    "User ID": 723145047784116200,
    "Display Name": "oppossumfrank",
    "Team Name": "Mango Mochi",
    "Wins": 9,
    "Losses": 7,
    "Ties": 0,
    "Points For": 953,
    "Points Against": 995,
    "Adjusted Average": 121.7,
    "TREND": "NO TREND",
    "Trend Percentage": -0.4,
    "QB Strength": 72,
    "RB Strength": 71,
    "WR Strength": 75,
    "TE Strength": 71,
    "K Strength": 61,
    "QB": "Joe Burrow",
    "RB": "Braelon Allen, James Conner, Rico Dowdle, Kenneth Walker, Chase Brown",
    "WR": "Diontae Johnson, DeVonta Smith, Amon-Ra St. Brown, Chris Olave",
    "TE": "Cade Otton, Tucker Kraft",
    "K": "Harrison Butker",
    "DEF": "Denver Broncos, Tennessee Titans",
    "Week 1": 121.96,
    "Week 2": 145,
    "Week 3": 78.41,
    "Week 4": 118.13,
    "Week 5": 125.04,
    "Week 6": 127.27,
    "Week 7": 127.59,
    "Week 8": 110.01,
    "POWER RANK": 7,
    "Power Rank Score": 5.82,
    "COMMENTS": "-5 FAAB hat Leo, nach eigenen Worten, letzte Woche sehr traurig gemacht. Aber nicht nur Mo's TE war Schuld an der Misere. Dowdle inactive, Sun God als Zuschauer in der ersten Reihe eines Massakers und K9 im Schoßhundmodus.\nHoffentlich bringt der Move von Dionte zu den Ravens ihm etwas Segen. Vermutlich eher nicht, denn Lamar ist ein guter QB und verteilt das Schweineleder, aber vielleicht wird Dionte sein neues Lieblingstarget, man weißet net. Ich würde es malwieder auf Harrison Butker schieben, der is Schuld.\nIn Woche 9 gibt's gegen Tilley Schleck erstmal ein vermutlich einfacheres Match-Up, denn kein Team kassiert mehr als das von Till."
  },
  {
    "User ID": 1127992026114461700,
    "Display Name": "benjyalf",
    "Team Name": "Yurr Kirk",
    "Wins": 10,
    "Losses": 6,
    "Ties": 0,
    "Points For": 958,
    "Points Against": 922,
    "Adjusted Average": 120,
    "TREND": "UP",
    "Trend Percentage": 23.9,
    "QB Strength": 71,
    "RB Strength": 78,
    "WR Strength": 55,
    "TE Strength": 52,
    "K Strength": 59,
    "QB": "Geno Smith, Jalen Hurts",
    "RB": "Jaleel McLaughlin, Saquon Barkley, Devin Singletary, Rachaad White",
    "WR": "Brian Thomas, Christian Kirk, A.J. Brown, Tank Dell, Quentin Johnston",
    "TE": "Hunter Henry, David Njoku",
    "K": "Tyler Bass",
    "DEF": "Philadelphia Eagles",
    "Week 1": 127.12,
    "Week 2": 103.42,
    "Week 3": 124.69,
    "Week 4": 98.12,
    "Week 5": 118.81,
    "Week 6": 105.91,
    "Week 7": 140.06,
    "Week 8": 139.99,
    "POWER RANK": 3,
    "Power Rank Score": 4.9,
    "COMMENTS": "Fly Eagles fly. Nach einer miserablen Hälfte haben die Eagles in Hälfte 2 voll aufgedreht. Hurts mit 3 \"rushing\" TDs (2 Falling, 1 rushing) und 37 Punkten, hat den Sieg gesichert. Die Verltzungen der Texans WR spielen Ben gut zu, da Tank jetzt erstmal wenig Competition hat.\nBens Truppe ist und bleibt richtig weird, weirdly good. Platz 2 mit 119 Punkten im Schnitt. Die Matchups laufen einfach nach Plan. Siege gegen ein paar top-scorer hat er bereits in der Tasche und solange sich niemand weiter verletzt bleibt das Team ein Contender, auch wenn er im Schnitt eigentlich wenig Punkte macht."
  },
  {
    "User ID": 723153820145758200,
    "Display Name": "MomentumBln",
    "Team Name": "Nabers Know My Name",
    "Wins": 9,
    "Losses": 7,
    "Ties": 0,
    "Points For": 1055,
    "Points Against": 951,
    "Adjusted Average": 129.6,
    "TREND": "UP",
    "Trend Percentage": 18,
    "QB Strength": 57,
    "RB Strength": 94,
    "WR Strength": 84,
    "TE Strength": 68,
    "K Strength": 100,
    "QB": "Kirk Cousins",
    "RB": "Josh Jacobs, Alexander Mattison, Rhamondre Stevenson, Kyren Williams, Zach Charbonnet",
    "WR": "Xavier Worthy, Malik Nabers, CeeDee Lamb, Romeo Doubs, Josh Downs",
    "TE": "Kyle Pitts",
    "K": "Will Reichard, Chris Boswell",
    "DEF": "Minnesota Vikings",
    "Week 1": 133.34,
    "Week 2": 102.24,
    "Week 3": 144.98,
    "Week 4": 154.08,
    "Week 5": 123.79,
    "Week 6": 98.85,
    "Week 7": 119.08,
    "Week 8": 178.7,
    "POWER RANK": 1,
    "Power Rank Score": 2.88,
    "COMMENTS": "Back with a Boom. 178 Dinger in Leos Gesicht. Der dritthöchste Score diese Season. Und sogar noch was liegen gelassen auf der Bank. Mo hat ein Händchen für Boom Weeks und ist daher auch zweimal in der All Time Weekly High Scores Top-10 vertreten.\n\"Das ist ein richtiger Mo-Spieler\" ist nicht umsonst oft gebrauchtes Lingo during Draft Season. Dudes die einfach mal explodieren für ein paar Wochen, oder mehr. Wenn er jetzt noch das QB Problem lösen kann, steht einem tiefen play-off run nichts mehr im Weg."
  },
  {
    "User ID": 723213691029368800,
    "Display Name": "jay88",
    "Team Name": "Run-CMC - Walk This Jay",
    "Wins": 6,
    "Losses": 10,
    "Ties": 0,
    "Points For": 869,
    "Points Against": 1025,
    "Adjusted Average": 111.3,
    "TREND": "DOWN",
    "Trend Percentage": -24.5,
    "QB Strength": 58,
    "RB Strength": 77,
    "WR Strength": 74,
    "TE Strength": 28,
    "K Strength": 19,
    "QB": "Tua Tagovailoa, C.J. Stroud",
    "RB": "Christian McCaffrey, Tony Pollard, Jordan Mason, Tank Bigsby, Tyjae Spears",
    "WR": "Tyreek Hill, Elijah Moore, Drake London, Jameson Williams, Jaxon Smith-Njigba",
    "TE": "Evan Engram",
    "K": "Brandon McManus",
    "DEF": "Detroit Lions, Los Angeles Chargers",
    "Week 1": 73.86,
    "Week 2": 110.25,
    "Week 3": 123.3,
    "Week 4": 139.05,
    "Week 5": 134.04,
    "Week 6": 114.63,
    "Week 7": 63.19,
    "Week 8": 111.66,
    "POWER RANK": 12,
    "Power Rank Score": 10.7,
    "COMMENTS": "Wenn man CMC auf der 1 gepickt hat, dann hat man genau 0 Picks gehabt, während alle anderen zweimal dran waren und sich die vermeintlich besten Spieler gegönnt haben. (Aunahmen wie ETN bestätigen die Regel)\n23 Picks nichts. Klingt schon richtig Scheiße. Aber Jays nächsten 7 Picks waren Drake London (fair enough) Kelce, Stroud (low-key schlecht in 2024), Flowers (mittel), Pollard (mittel), Odunze (fantasy bust) und Gus (totalausfall).\nDurch gute Trades ist jay überhaupt noch ansatzweise dabei. 2022 war Jay auch abgeschlagen in der Regular Season und kam am Ende mit einem Surge, angeführt von McKinnon, noch zum Titel. Never say never."
  },
  {
    "User ID": 986549581037002800,
    "Display Name": "flashdw3",
    "Team Name": "Traylor Swelce",
    "Wins": 6,
    "Losses": 10,
    "Ties": 0,
    "Points For": 898,
    "Points Against": 923,
    "Adjusted Average": 111.9,
    "TREND": "NO TREND",
    "Trend Percentage": -1.2,
    "QB Strength": 69,
    "RB Strength": 86,
    "WR Strength": 59,
    "TE Strength": 56,
    "K Strength": 75,
    "QB": "Caleb Williams, Brock Purdy",
    "RB": "Jonathon Brooks, Aaron Jones, D'Andre Swift, Tyler Allgeier, De'Von Achane",
    "WR": "Rashee Rice, Jalen McMillan, Rome Odunze, Ladd McConkey, Tyler Lockett, Deebo Samuel",
    "TE": "Travis Kelce, Mark Andrews",
    "K": "Justin Tucker",
    "DEF": "New Orleans Saints",
    "Week 1": 142.36,
    "Week 2": 122.76,
    "Week 3": 116.83,
    "Week 4": 89.52,
    "Week 5": 85.21,
    "Week 6": 119.5,
    "Week 7": 88.48,
    "Week 8": 134.25,
    "POWER RANK": 10,
    "Power Rank Score": 9.35,
    "COMMENTS": "The A-Train has left the Station, next stop Playoffs. Zum ersten Mal nach Woche 1 endlich wieder die magische 130 Punkte Schallmauer durchbrochen. Feels Good Man. Kelce is Back, Swift bleibt strong (auch wenn es, wie jede Woche, an einem long run) und der Brockstar performt weit über seiner Gehaltsklasse.\nJetzt setzt Sven auf dreckige Mindtricks und spielt Caleb gegen mich in Woche 9. Find ich kacke. Vielleicht sollte ich meinen Mooney gegen seinen McConkey aufstellen, für ein kleines Trade-Off."
  },
  {
    "User ID": 1137349364512510000,
    "Display Name": "sandmann1ps",
    "Team Name": "No Team Name",
    "Wins": 6,
    "Losses": 10,
    "Ties": 0,
    "Points For": 897,
    "Points Against": 942,
    "Adjusted Average": 110.6,
    "TREND": "NO TREND",
    "Trend Percentage": -4,
    "QB Strength": 100,
    "RB Strength": 54,
    "WR Strength": 85,
    "TE Strength": 45,
    "K Strength": 64,
    "QB": "Lamar Jackson, Anthony Richardson",
    "RB": "Austin Ekeler, Travis Etienne, Javonte Williams",
    "WR": "Tre Tucker, Keon Coleman, Amari Cooper, Michael Pittman, Ja'Marr Chase, Rashod Bateman, Jalen Nailor",
    "TE": "Sam LaPorta",
    "K": "Jason Myers",
    "DEF": "Buffalo Bills",
    "Week 1": 90.52,
    "Week 2": 106.63,
    "Week 3": 145.18,
    "Week 4": 103.89,
    "Week 5": 148.27,
    "Week 6": 85.27,
    "Week 7": 124.49,
    "Week 8": 93.06,
    "POWER RANK": 11,
    "Power Rank Score": 10,
    "COMMENTS": "Hoch, Runter, Hoch, Runter, Hoch.... seit Woche zwei wechseln sich bei Peter die Wochen mit High und Low Scoring ab. Also mach dich auf mindesten 120 Punkte gefasst Köppi.\nDurch ein paar gute waiver moves sieht das Team ganz gut aus. Auch die real life trades und Roster decisions kommen Peter zu Gute. Pittman hat jetzt Flacco, Tucker ohne Adams, Coleman beflügelt durch Cooper. Ich sehe hier viel Potenzial für eine starke zweite Hälfte. Somal er mit Jamar den WR1 und mit Lamar den QB1 im Team hat. Jamar und Lamar, da geht doch wa Teamname mäßig für eines der \"No Team Name\" teams."
  }
]